---
type: SolidOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# SolidOptions

`Autodesk.Revit.DB.SolidOptions` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SolidOptions | 2015 | `public SolidOptions ( ElementId materialId , ElementId graphicsStyleId )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | ExtraFaceAndEdgeHistoryKey | 2015 | `public int ExtraFaceAndEdgeHistoryKey { get ; set ; }` |
| Property | GraphicsStyleId | 2015 | `public ElementId GraphicsStyleId { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | MaterialId | 2015 | `public ElementId MaterialId { get ; set ; }` |